from pyscript import display, document  # type: ignore

def compute_gwa(e):
    try:
        g1 = float(document.getElementById('English').value)
        g2 = float(document.getElementById('Math').value)
        g3 = float(document.getElementById('Science').value)
        g4 = float(document.getElementById('Social Studies').value)
        g5 = float(document.getElementById('Filipino').value)

        gwa = (g1 + g2 + g3 + g4 + g5) / 5
        display(f'𓊈ྀི ʏᴏᴜʀ ɢᴡᴀ ɪꜱ {gwa:.2f} 𓊉ྀི', target="output")
    except Exception:
        display("⚠️ ᴘʟᴇᴀꜱᴇ ᴇɴᴛᴇʀ ᴠᴀʟɪᴅ ɴᴜᴍʙᴇʀꜱ ɪɴ ᴀʟʟ ꜰɪᴇʟᴅꜱ ⚠️", target="output")


clubs = {
    
    "𓊆ྀི ꜱᴄɪᴇɴᴄᴇ ᴄʟᴜʙ 𓊇ྀི": "ᴀ ᴄᴏᴍᴍᴜɴɪᴛʏ ꜰᴏʀ ꜱᴛᴜᴅᴇɴᴛꜱ ᴡʜᴏ ʟᴏᴠᴇ ᴅɪꜱᴄᴏᴠᴇʀɪɴɢ ʜᴏᴡ ᴛʜɪɴɢꜱ ᴡᴏʀᴋ. ᴍᴇᴍʙᴇʀꜱ ᴛʀʏ ʜᴀɴᴅꜱ-ᴏɴ ᴇxᴘᴇʀɪᴍᴇɴᴛꜱ, ᴇxᴘʟᴏʀᴇ ʙɪᴏʟᴏɢʏ, ᴄʜᴇᴍɪꜱᴛʀʏ, ᴀɴᴅ ᴘʜʏꜱɪᴄꜱ, ᴀɴᴅ ᴇᴠᴇɴ ʙᴜɪʟᴅ ꜱɪᴍᴘʟᴇ ʀᴏʙᴏᴛɪᴄꜱ ᴀɴᴅ ᴛᴇᴄʜ ᴘʀᴏᴊᴇᴄᴛꜱ. ɪᴛ’ꜱ ᴀɴ ᴇxᴄɪᴛɪɴɢ ᴡᴀʏ ᴛᴏ ʟᴇᴀʀɴ ʜᴏᴡ ꜱᴄɪᴇɴᴄᴇ ᴄᴏɴɴᴇᴄᴛꜱ ᴛᴏ ᴇᴠᴇʀʏᴅᴀʏ ʟɪꜰᴇ.",
    "𓊆ྀི ᴀʀᴛꜱ ᴄʟᴜʙ 𓊇ྀི": "ᴀ ᴄʀᴇᴀᴛɪᴠᴇ ꜱᴘᴀᴄᴇ ꜰᴏʀ ꜱᴛᴜᴅᴇɴᴛꜱ ᴡʜᴏ ᴇɴᴊᴏʏ ᴍᴀᴋɪɴɢ ᴠɪꜱᴜᴀʟ ᴀʀᴛ. ᴍᴇᴍʙᴇʀꜱ ᴘᴀɪɴᴛ, ᴅʀᴀᴡ, ꜱᴄᴜʟᴘᴛ, ᴀɴᴅ ᴇxᴘᴇʀɪᴍᴇɴᴛ ᴡɪᴛʜ ᴅɪꜰꜰᴇʀᴇɴᴛ ᴍᴀᴛᴇʀɪᴀʟꜱ ᴡʜɪʟᴇ ʟᴇᴀʀɴɪɴɢ ɴᴇᴡ ᴛᴇᴄʜɴɪQᴜᴇꜱ. ɪᴛ’ꜱ ᴀ ꜰʀɪᴇɴᴅʟʏ ᴘʟᴀᴄᴇ ᴛᴏ ᴇxᴘʀᴇꜱꜱ ɪᴅᴇᴀꜱ, ɪᴍᴘʀᴏᴠᴇ ꜱᴋɪʟʟꜱ, ᴀɴᴅ ᴄᴏʟʟᴀʙᴏʀᴀᴛᴇ ᴡɪᴛʜ ꜰᴇʟʟᴏᴡ ᴀʀᴛɪꜱᴛꜱ.",
    "𓊆ྀི ᴍᴜꜱɪᴄ ᴄʟᴜʙ 𓊇ྀི": "ᴀ ɢʀᴏᴜᴘ ꜰᴏʀ ꜱᴛᴜᴅᴇɴᴛꜱ ᴡʜᴏ ᴇɴᴊᴏʏ ꜱɪɴɢɪɴɢ, ᴘʟᴀʏɪɴɢ ɪɴꜱᴛʀᴜᴍᴇɴᴛꜱ, ᴀɴᴅ ᴘᴇʀꜰᴏʀᴍɪɴɢ. ᴍᴇᴍʙᴇʀꜱ ᴘʀᴀᴄᴛɪᴄᴇ ᴛᴏɢᴇᴛʜᴇʀ, ꜱᴛᴜᴅʏ ɴᴇᴡ ᴘɪᴇᴄᴇꜱ, ᴀɴᴅ ᴊᴏɪɴ ꜱᴄʜᴏᴏʟ ᴘʀᴏɢʀᴀᴍꜱ ᴀɴᴅ ᴄᴏᴍᴘᴇᴛɪᴛɪᴏɴꜱ. ɪᴛ’ꜱ ᴀ ᴄʜᴀɴᴄᴇ ᴛᴏ ɢʀᴏᴡ ᴍᴜꜱɪᴄᴀʟʟʏ ᴡʜɪʟᴇ ᴇɴᴊᴏʏɪɴɢ ᴛʜᴇ ᴇxᴘᴇʀɪᴇɴᴄᴇ ᴏꜰ ᴘᴇʀꜰᴏʀᴍɪɴɢ ᴡɪᴛʜ ᴏᴛʜᴇʀꜱ.",
    "𓊆ྀི ꜱᴘᴏʀᴛꜱ ᴄʟᴜʙ 𓊇ྀི": "ᴀ ᴄʟᴜʙ ꜰᴏʀ ꜱᴛᴜᴅᴇɴᴛꜱ ᴡʜᴏ ᴡᴀɴᴛ ᴛᴏ ꜱᴛᴀʏ ᴀᴄᴛɪᴠᴇ ᴀɴᴅ ᴇɴᴊᴏʏ ᴛᴇᴀᴍ ᴀᴄᴛɪᴠɪᴛɪᴇꜱ. ᴍᴇᴍʙᴇʀꜱ ᴊᴏɪɴ ɢᴀᴍᴇꜱ ʟɪᴋᴇ ʙᴀꜱᴋᴇᴛʙᴀʟʟ ᴀɴᴅ ᴠᴏʟʟᴇʏʙᴀʟʟ ᴡʜɪʟᴇ ʟᴇᴀʀɴɪɴɢ ᴛᴇᴀᴍᴡᴏʀᴋ, ᴅɪꜱᴄɪᴘʟɪɴᴇ, ᴀɴᴅ ꜰᴀɪʀ ᴘʟᴀʏ. ɪᴛ’ꜱ ᴀ ꜰᴜɴ ᴡᴀʏ ᴛᴏ ʙᴜɪʟᴅ ꜱᴛʀᴇɴɢᴛʜ, ꜱᴛᴀʏ ʜᴇᴀʟᴛʜʏ, ᴀɴᴅ ᴍᴀᴋᴇ ꜰʀɪᴇɴᴅꜱ."

}

def show_club(e):
    name = document.getElementById('club').value
    info = clubs.get(name, "Club not found.")
    display(info, target="clubOutput")
